neddybenchmark/reports/sc/neddy/ab_c100.log
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.127 (be patient)


Server Software:        Neddy/1.0.0
Server Hostname:        192.168.1.127
Server Port:            8090

Document Path:          /index.html
Document Length:        177 bytes

Concurrency Level:      100
Time taken for tests:   79.725 seconds
Complete requests:      1000000
Failed requests:        0
Write errors:           0
Keep-Alive requests:    1000000
Total transferred:      370000000 bytes
HTML transferred:       177000000 bytes
Requests per second:    12543.18 [#/sec] (mean)
Time per request:       7.972 [ms] (mean)
Time per request:       0.080 [ms] (mean, across all concurrent requests)
Transfer rate:          4532.20 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0      11
Processing:     0    8   4.3      7     250
Waiting:        0    8   4.3      7     250
Total:          0    8   4.4      7     250

Percentage of the requests served within a certain time (ms)
  50%      7
  66%      8
  75%      8
  80%      8
  90%      9
  95%     14
  98%     16
  99%     17
 100%    250 (longest request)