neddybenchmark/reports/sc/neddy/ab_c1000.log
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.127 (be patient)


Server Software:        Neddy/1.0.0
Server Hostname:        192.168.1.127
Server Port:            8090

Document Path:          /index.html
Document Length:        177 bytes

Concurrency Level:      1000
Time taken for tests:   71.664 seconds
Complete requests:      1000000
Failed requests:        0
Write errors:           0
Keep-Alive requests:    1000000
Total transferred:      370000000 bytes
HTML transferred:       177000000 bytes
Requests per second:    13954.03 [#/sec] (mean)
Time per request:       71.664 [ms] (mean)
Time per request:       0.072 [ms] (mean, across all concurrent requests)
Transfer rate:          5041.98 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2  69.5      0    7142
Processing:     0   70  26.1     70    1513
Waiting:        0   70  26.1     70    1513
Total:          0   72  75.1     70    7271

Percentage of the requests served within a certain time (ms)
  50%     70
  66%     74
  75%     76
  80%     77
  90%     81
  95%     87
  98%    133
  99%    151
 100%   7271 (longest request)