neddybenchmark/reports/sc/neddy/ab_c50.log
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.127 (be patient)


Server Software:        Neddy/1.0.0
Server Hostname:        192.168.1.127
Server Port:            8090

Document Path:          /index.html
Document Length:        177 bytes

Concurrency Level:      50
Time taken for tests:   79.772 seconds
Complete requests:      1000000
Failed requests:        0
Write errors:           0
Keep-Alive requests:    1000000
Total transferred:      370000000 bytes
HTML transferred:       177000000 bytes
Requests per second:    12535.79 [#/sec] (mean)
Time per request:       3.989 [ms] (mean)
Time per request:       0.080 [ms] (mean, across all concurrent requests)
Transfer rate:          4529.53 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       5
Processing:     0    4   1.8      4     115
Waiting:        0    4   1.7      3     115
Total:          0    4   1.8      4     115

Percentage of the requests served within a certain time (ms)
  50%      4
  66%      4
  75%      4
  80%      4
  90%      6
  95%      7
  98%      8
  99%      9
 100%    115 (longest request)